{"packages": [{"Name": "at-spi2-atk", "Arch": "x86_64", "Release": "2.amzn2.0.2", "Size": "228 k", "Repo": "installed", "Summary": "A GTK+ module that bridges ATK to D-Bus at-spi", "URL": "https", "License": "LGPLv2+", "description": "at-spi allows assistive technologies to access GTK-based  applications. Essentially it exposes the internals of applications  for automation, so tools such as screen readers, magnifiers, or  even scripting interfaces can query and interact with GUI  controls.   This version of at-spi is a major break from previous versions.  It has been completely rewritten to use D-Bus rather than  ORBIT / CORBA for its transport protocol.   This package includes a gtk-module that bridges ATK to the new  D-Bus based at-spi."}, {"Name": "mythes", "Arch": "x86_64", "Release": "7.amzn2.0.2", "Size": "19 k", "Repo": "installed", "Summary": "A thesaurus library", "URL": "http", "License": "BSD and MIT", "description": "MyThes is a simple thesaurus that uses a structured text data file  and an index file with binary search to look up words and phrases  and return information on part of speech, meanings, and synonyms."}, {"Name": "perl-Getopt-Long", "Arch": "noarch", "Release": "3.amzn2", "Size": "132 k", "Repo": "installed", "Summary": "Extended processing of command line options", "URL": "http", "License": "GPLv2+ or Artistic", "description": "The Getopt  called GetOptions(). It parses the command line from @ARGV,  recognizing and removing specified options and their possible  values.  It adheres to the POSIX syntax for command line options,  with GNU extensions. In general, this means that options have long  names instead of single letters, and are introduced with a double  dash \"--\". Support for bundling of command line options, as was  the case with the more traditional single-letter approach, is  provided but not enabled by default."}, {"Name": "mesa-libgbm", "Arch": "i686", "Release": "8.20171019.amzn2.0.4", "Size": "60 k", "Repo": "installed", "Summary": "Mesa gbm library", "URL": "http", "License": "MIT", "description": "Mesa gbm runtime library."}], "package_count": 4}